Berichtencatalogus/uitgifteservice/DC_Request_Cirkel.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchCharacteristicsRequest 
                xmlns="http://www.broservices.nl/xsd/dsbhr-gt/2.1"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsbhr-gt/2.1 https://schema.broservices.nl/xsd/dsbhr-gt/2.1/dsbhr-gt-messages.xsd"
            >
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
                 Het houdt geen rekening met bedrijfsregels en is mogelijkerwijs vaktechnisch/inhoudelijk niet voorbeeldig.
            -->
            <brocom:requestReference>uitgifte-24</brocom:requestReference>
            <criteria>
                <brocom:area>
                    <brocom:enclosingCircle srsName="urn:ogc:def:crs:EPSG::4258">
                        <brocom:center>52.287820209 5.090415499</brocom:center>
                        <brocom:radius uom="km">10</brocom:radius>
                    </brocom:enclosingCircle>
                </brocom:area>
                <discipline codeSpace="urn:bro:bhrgt:Discipline">geotechniek</discipline>
            </criteria>
        </dispatchCharacteristicsRequest>
    </soap:Body>
</soap:Envelope>
